from math import *

# Положение БР в сферической Земле
# Восточный
# fi = radians(51.48)
# ly = radians(128.17)

# Байконур
fi = radians(45.57)
ly = radians(63.18)

thetc = radians(89.0)
psic = radians(0)

thetk = radians(16)
thet = radians(89.0)
alpha = betta = gama = psi = 0.0

# Скорость
V = 1  # м/с
vxg, vyg, vzg = 0, 0, 0
vx, vy, vz = 0, 0, 0

# Координаты
xg, yg, zg = 0, 1, 0

# Время
t = 0.0  # м/с

# Угловая скорость, момент инерции, G
wx, wy, wz = 0, 0, 0

# Учет вращения
lymbda = 7.292e-5  # рад/с
pi_0 = 3.9859e14  # м3/c2
Rz = 6371000  # м
pON = 101325  # Па

# Радиус-вектор
r = (xg**2 + (yg + Rz) ** 2 + zg**2) ** 0.5

# Габариты ОТР
# dm1 = 3 # Диаметр миделя 1 ступени
# dm2 = 2.4 # Диаметр мидаля 2 ступени
# da1 = 1.792488514 # Диаметр выходного сечения сопла 1 ступени
# da2 = 0.566918072 # Диаметр выходного сечения сопла 2 ступени
# Lp = 21	 # Полная длина ракеты
# Lp1 = 13 # Длина 1 ступени
# Lp2 = 3 # Длина 2 ступени
# Lgh = 4.5 # Длина ГЧ
# Ix1 = Iy1 = 1951829.822
# Ix2 = Iy2 = 49187.51591
# Ix3 = Iy3 = 26028
# Iz1 = 1400622.437
# Iz2 = 49547.9862
# Iz3 = 3456
dm1, dm2, da1, da2, Lp, Lp1, Lp2, Lgh, Ix1, Ix2, Ix3, Iz1, Iz2, Iz3 = (
    3.05,
    3.05,
    1.820036604,
    1.004813555,
    24.1041835,
    11.47148589,
    4.141604948,
    5,
    1704213.819,
    161904.5074,
    60662.8875,
    2382677.771,
    181703.6818,
    10325.775,
)
mGH, m01, m02, mk01, mk02, P01, P02, msec1, msec2, tk1, tk2 = (
    3700,
    116500,
    27069.86138,
    34950,
    7517.752322,
    2284949.45,
    371650.5185,
    -781.073194,
    -110.1833663,
    104.4076287,
    177.4506417,
)

Iy1 = Ix1
Iy2 = Ix2
Iy3 = Ix3

# mGH = 2000  # Масса ГЧ
# m01 = 113000 # Масса 1 ступени
# m02 = 10967.0801 # Масса 2 ступени
# mk01 = 19210 # Масса консрукции 1 ступени
# mk02 = 3545.82724  # Масса консрукции 2 ступени
# P01 = 2216302.9 # Тяга 1 ступени
# P02 = 118305.3476 # Тяга 2 ступени
# msec1 = -757.6074758 # Массовый расход первой ступени
# msec2 = -35.07403006 # Массовый расход второй ступени
# tk1 = 123.7976168 # Конец АУТ 1 ступени
# tk2 = 211.5882562 # Конец АУТ 2 ступени


# Славян
# dm1 = 2.5 # Диаметр миделя 1 ступени
# dm2 = 2.5 # Диаметр мидаля 2 ступени
# da1 = 0.557 # Диаметр выходного сечения сопла 1 ступени
# da2 = 0.427 # Диаметр выходного сечения сопла 2 ступени
# Lp = 23.271 # Полная длина ракеты
# Lp1 = 13.41 # Длина 1 ступени
# Lp2 = 7 # Длина 2 ступени
# Lgh = 3.5 # Длина ГЧ
# Ix1 = Iy1 = 1951829.822
# Ix2 = Iy2 = 49187.51591
# Ix3 = Iy3 = 26028
# Iz1 = 1400622.437
# Iz2 = 49547.9862
# Iz3 = 3456
# mGH = 3700  # Масса ГЧ
# m01 = 106500 # Масса 1 ступени
# m02 = 29287.5 # Масса 2 ступени
# mk01 = m01-68894 # Масса консрукции 1 ступени
# mk02 = m02-23729  # Масса консрукции 2 ступени
# P01 = 1879e3 # Тяга 1 ступени
# P02 = 402e3 # Тяга 2 ступени
# msec1 = -636.1 # Массовый расход первой ступени
# msec2 = -119.2 # Массовый расход второй ступени
# tk1 = 108.3 # Конец АУТ 1 ступени
# tk2 = 199 # Конец АУТ 2 ступени
